nouvelle	0.49766406416893005
brushes	0.523968517780304
wobbly	0.5204724669456482
spiral	0.4819633662700653
hostage	0.4519188404083252
conjure	0.4993618428707123
hippopotamus	0.4843570590019226
cracking	0.4831753969192505
battling	0.4572538137435913
selfpreservation	0.4670819044113159
humanize	0.5212892293930054
amalgam	0.47943949699401855
atop	0.4493089020252228
mornings	0.5141956806182861
switchblade	0.3865460753440857
local	0.4813176989555359
marvel	0.4833853244781494
mcdonalds	0.4178781509399414
dumber	0.48608729243278503
atreve	0.4708057641983032
poutylipped	0.49992260336875916
forest	0.4883882999420166
tracts	0.4958609938621521
flavours	0.5224900245666504
sky	0.5081728100776672
stylistically	0.5061439871788025
exotic	0.49687033891677856
slipperiness	0.502358078956604
freddy	0.5002884268760681
subtlety	0.5153034925460815
deliberate	0.47992727160453796
fairy	0.47888851165771484
universe	0.49485665559768677
discontented	0.4716864228248596
fertile	0.4941507875919342
enlightening	0.4955870807170868
roadtrip	0.4777889549732208
libertine	0.4814147651195526
guei	0.5847285389900208
sidebyside	0.501413881778717
eras	0.48376187682151794
accordionharmonicabanjo	0.43881064653396606
lad	0.5096846222877502
angst	0.40863609313964844
beatcharged	0.4760552942752838
fabric	0.5080390572547913
earns	0.5558003783226013
malcolm	0.49376052618026733
transgressive	0.4523082971572876
overly	0.5141029953956604
yield	0.5793531537055969
león	0.48152297735214233
ecological	0.5647072196006775
targets	0.47946152091026306
preference	0.4976448714733124
cup	0.45872852206230164
cram	0.47644972801208496
undercuts	0.5286491513252258
shinya	0.4918317198753357
hackneyed	0.4891476333141327
chef	0.5349331498146057
installation	0.5102835297584534
allows	0.49539491534233093
highs	0.4902099370956421
philosophers	0.49167340993881226
actory	0.5150819420814514
mehtas	0.47024041414260864
ribald	0.48860883712768555
along	0.49052050709724426
grimness	0.4952694773674011
envious	0.4822680950164795
legged	0.49304094910621643
restless	0.5086841583251953
oscarwinning	0.4934009909629822
suck	0.4759386479854584
costumer	0.5077759623527527
clumsy	0.4719891846179962
confluence	0.4929077625274658
vine	0.5034701824188232
spending	0.46113625168800354
dullest	0.48513370752334595
blurry	0.49247443675994873
net	0.40934768319129944
muy	0.4821493625640869
samurai	0.46227598190307617
olives	0.4716290235519409
plausibility	0.4851294457912445
langs	0.5227663516998291
chong	0.49627792835235596
unobtrusively	0.5246713161468506
bask	0.45776310563087463
painstaking	0.4893299341201782
cadence	0.4990578293800354
prescinde	0.47206196188926697
veers	0.5218064188957214
stopped	0.4990864098072052
twentieth	0.4800999164581299
fighter	0.5313303470611572
decirles	0.4804179072380066
trots	0.4926605820655823
invariably	0.48124587535858154
clockstoppers	0.5106166005134583
sending	0.4820830225944519
springs	0.4928947985172272
touchyfeely	0.45289602875709534
complaint	0.5067300200462341
selfreflection	0.5655231475830078
personality	0.5812518000602722
done	0.5317549705505371
easy	0.48588797450065613
nolan	0.5388547778129578
basedontruth	0.5126603245735168
melds	0.515880823135376
courts	0.5082554817199707
linking	0.4933222234249115
actioncomedy	0.49568191170692444
body	0.44244199991226196
handed	0.4725955128669739
desire	0.4736447334289551
extemporaneously	0.5110660195350647
rhapsodic	0.48345836997032166
reserve	0.49104854464530945
mike	0.47491034865379333
wouldbe	0.4983065724372864
orc	0.5186182856559753
petins	0.5050355792045593
squandering	0.5039608478546143
roughtrade	0.5259656310081482
incredibly	0.5065617561340332
moretti	0.5231916308403015
consistency	0.50079345703125
spaghetti	0.47653257846832275
equally	0.5366415977478027
myer	0.47008848190307617
specialty	0.4834572970867157
flopped	0.4367275536060333
slip	0.4969107210636139
reyes	0.4792318642139435
patriarchal	0.5098010897636414
personagens	0.46120259165763855
enigma	0.5098975896835327
artificial	0.47914350032806396
gutsy	0.5173919200897217
nancy	0.5463093519210815
longing	0.4825479984283447
reduced	0.49238619208335876
charlotte	0.5007014870643616
penns	0.43368518352508545
selfsatisfied	0.505136251449585
employment	0.4707302451133728
rendering	0.49789777398109436
cheated	0.4639450013637543
rarest	0.47241654992103577
drives	0.4970235824584961
erratic	0.48436373472213745
handson	0.500943660736084
adored	0.5215358138084412
melodic	0.4744011163711548
admirer	0.47729048132896423
rigged	0.4963964819908142
successes	0.49790817499160767
pg13rated	0.430145263671875
leplouff	0.5014508962631226
skinner	0.5528614521026611
years	0.5661300420761108
deliverance	0.5015484690666199
leguizamo	0.4853404760360718
cleverest	0.46098077297210693
succeeded	0.46152856945991516
barbers	0.48293188214302063
roads	0.4839015305042267
168minute	0.4951079785823822
hankies	0.43288472294807434
lowwattage	0.5422968864440918
type	0.49916765093803406
simplest	0.4762423038482666
potentially	0.5000555515289307
engulfing	0.39075687527656555
offends	0.5182086229324341
defeats	0.5005403757095337
truck	0.47654989361763
modernized	0.5250754952430725
quiet	0.48363327980041504
pgrated	0.4183201193809509
preceded	0.5280945897102356
depressingly	0.5353031158447266
pair	0.47231507301330566
beer	0.5023426413536072
subordinate	0.5085607767105103
literal	0.4901387393474579
section	0.5260744690895081
cautionary	0.4936618208885193
irony	0.45771053433418274
kurds	0.4753061830997467
draggy	0.5135833621025085
whiteonblack	0.4775189459323883
stolid	0.47213029861450195
lovestruck	0.48716965317726135
irk	0.4659619629383087
pelo	0.480252206325531
indictment	0.4231746196746826
interlocking	0.49226394295692444
bouncing	0.48709362745285034
beat	0.4730902910232544
entertainments	0.44292429089546204
plants	0.4962926506996155
uh	0.4652479588985443
deranged	0.4881843030452728
solipsistic	0.5395574569702148
videotape	0.49002334475517273
blanket	0.4167717397212982
crassly	0.4867529571056366
insultingly	0.4310152530670166
succession	0.4603734016418457
learned	0.5200725793838501
welty	0.4772178828716278
thrashing	0.49114009737968445
sweep	0.5085701942443848
herd	0.47285622358322144
unassuming	0.42824164032936096
dogtown	0.47264596819877625
tamer	0.45462146401405334
stoned	0.502047598361969
leftover	0.47261276841163635
vagueness	0.4927663207054138
iconography	0.5118653774261475
verismo	0.5216693878173828
haunted	0.49327316880226135
multidimensional	0.4699443578720093
ever	0.490241676568985
stalkandslash	0.4923180639743805
transmogrification	0.4684981107711792
rappers	0.5079188942909241
order	0.44608500599861145
wintry	0.483788400888443
bonanza	0.4820834696292877
overnight	0.4605327844619751
stevensons	0.49968022108078003
glides	0.4908476173877716
diminishes	0.45576533675193787
kudos	0.5156603455543518
tartakovskys	0.5392034649848938
everlyn	0.47659483551979065
reeltoreel	0.4809766709804535
transfer	0.49146807193756104
hyper	0.4811888337135315
reawaken	0.4744018316268921
battista	0.5237528085708618
remembered	0.4999004900455475
poking	0.5037011504173279
imamuras	0.49784770607948303
irwins	0.4911958575248718
editorial	0.5092260241508484
referred	0.5056803226470947
meyers	0.5019106268882751
governs	0.46661946177482605
aniston	0.419285386800766
barrel	0.5068418383598328
croze	0.4863184690475464
practitioners	0.49141326546669006
representations	0.4604529142379761
oliveira	0.518123984336853
grass	0.4963013529777527
inolvidable	0.46477386355400085
kennedy	0.48129260540008545
exhilarating	0.48968231678009033
911	0.4051443636417389
national	0.5029926300048828
wladyslaw	0.5082578659057617
energies	0.45159977674484253
tender	0.4936024248600006
style	0.4879629909992218
planos	0.45518407225608826
comparatively	0.48500940203666687
sink	0.47561317682266235
disappointingly	0.4886053204536438
infinitely	0.5049502849578857
acrid	0.5048660039901733
touching	0.5170854926109314
predictability	0.48797741532325745
smarts	0.5594294667243958
radiates	0.5477280020713806
scatological	0.4933742880821228
kidlets	0.4819483757019043
horde	0.4882540702819824
check	0.5178897976875305
ateam	0.5163975954055786
nincompoop	0.5161697268486023
lens	0.4951825439929962
pain	0.47112157940864563
laughably	0.498164564371109
else	0.5297639966011047
irrepressible	0.5093992948532104
é	0.4699483811855316
form	0.47109365463256836
inthering	0.4915819466114044
49yearold	0.4630248546600342
spouse	0.49273476004600525
exercises	0.4602631628513336
tract	0.48939698934555054
photographed	0.4981214702129364
honoré	0.5246107578277588
catalytic	0.5188966989517212
progression	0.5076004266738892
instilling	0.5426933169364929
awkwardly	0.4452829658985138
histrionic	0.508988082408905
conanesque	0.48534438014030457
balk	0.5598810315132141
subgenres	0.5177192091941833
haul	0.5138346552848816
preferring	0.5316185355186462
diverse	0.5209031701087952
idiots	0.4829917848110199
madcap	0.4866955280303955
niccols	0.4705880582332611
hums	0.4854028522968292
doctors	0.4749731123447418
dystopia	0.462048202753067
nonshakespeare	0.44719940423965454
mckay	0.45803987979888916
fincher	0.490797758102417
adolescents	0.5006219148635864
composure	0.4948517084121704
penetrates	0.45960989594459534
haywire	0.49035197496414185
orleans	0.4898659586906433
unhappily	0.4548039138317108
acidic	0.47274360060691833
marvelously	0.5208649635314941
sack	0.5569442510604858
asiaphiles	0.435062974691391
severe	0.48128822445869446
behind	0.45723244547843933
befuddlement	0.46878957748413086
beliefs	0.43747973442077637
laidback	0.4903644919395447
independence	0.49641522765159607
speculative	0.41309887170791626
now	0.5052390098571777
powerpuff	0.476948618888855
mile	0.4868367314338684
heidis	0.4933004379272461
clueless	0.4710739254951477
slice	0.47758468985557556
unrelated	0.5463116765022278
werner	0.497932493686676
heart	0.4598057270050049
disarming	0.48918992280960083
persnickety	0.4788132309913635
eccentric	0.5290228724479675
inclination	0.46404290199279785
moralism	0.5152331590652466
gorefests	0.49574097990989685
contemplation	0.5132562518119812
clubs	0.5335286855697632
musketeers	0.4667166769504547
creatures	0.4843667149543762
advert	0.5291953682899475
depart	0.48109662532806396
slowpaced	0.5009738802909851
eisenbergs	0.475709468126297
malik	0.5090211629867554
baz	0.48310422897338867
holidayseason	0.6009752750396729
malles	0.49674782156944275
narcissistic	0.4987937808036804
redeem	0.48418402671813965
fumbled	0.43497321009635925
teeming	0.53068608045578
wrenches	0.4900049865245819
wool	0.5139192342758179
jostling	0.5215083956718445
grownups	0.43900755047798157
d	0.487009197473526
stepdad	0.4791509807109833
monica	0.48576241731643677
shimmers	0.5321289896965027
suitably	0.45010626316070557
cues	0.4408636689186096
philbin	0.4901205599308014
pastry	0.4792271554470062
pimental	0.4794465899467468
chomps	0.48090314865112305
eric	0.4869658648967743
serrault	0.5120134949684143
dad	0.4905394911766052
feminism	0.4934844672679901
disturbance	0.4852083921432495
feeling	0.514702558517456
seats	0.565850019454956
frontal	0.48538506031036377
teatral	0.49120816588401794
rich	0.46666258573532104
mechanical	0.4931705892086029
smoother	0.4573376774787903
daring	0.4808014929294586
legends	0.5118311047554016
concentration	0.5002692341804504
shecute	0.5349006056785583
flagwaving	0.5067811012268066
adams	0.4764489531517029
adrenalin	0.5084056258201599
patriot	0.49976128339767456
programa	0.46234196424484253
lacks	0.4539433419704437
humiliated	0.4665144681930542
synthesis	0.5206811428070068
confirms	0.4835812449455261
inexpressible	0.5434964299201965
sealed	0.4778520464897156
bartleby	0.4835664629936218
unknown	0.45691314339637756
express	0.5635639429092407
loses	0.5397505760192871
farrell	0.496280699968338
extraordinary	0.514295220375061
esquerdo	0.4349878430366516
forefront	0.5147712230682373
centered	0.4804505407810211
episodes	0.4809498190879822
divides	0.4259081780910492
digit	0.517256498336792
memoir	0.49799615144729614
ingest	0.3911433517932892
anniemary	0.4799882769584656
toughman	0.45285764336586
shirt	0.4866481125354767
selfimportant	0.4872947335243225
home	0.5453104376792908
bungling	0.4538058936595917
kilmer	0.43397581577301025
leblanc	0.4889497756958008
tapdancing	0.5052042603492737
delta	0.47758156061172485
tipped	0.4794318675994873
arliss	0.48190340399742126
reverent	0.5049557685852051
wealth	0.4821298122406006
dollop	0.41381511092185974
popup	0.4868530035018921
techniques	0.5561147928237915
treated	0.5206131935119629
flexathon	0.490988552570343
contours	0.48959285020828247
lecherous	0.514883279800415
sham	0.5311922430992126
deja	0.5234322547912598
olympic	0.49750396609306335
everythings	0.4955313801765442
bellini	0.44732752442359924
ub	0.5282255411148071
rusi	0.5077175498008728
gibney	0.500684380531311
depression	0.5720263719558716
suburban	0.4883384704589844
deserved	0.4211919903755188
groups	0.5148674249649048
mistaken	0.4810047745704651
rigor	0.5465680360794067
jerry	0.5164804458618164
ackerman	0.5087862610816956
downward	0.4651622772216797
detailing	0.3843522071838379
grandfather	0.47913292050361633
hayek	0.4462595582008362
resumes	0.4713050127029419
rings	0.49820610880851746
lowheat	0.4632396399974823
predictably	0.4926992952823639
rip	0.46912238001823425
heartfelt	0.4723280072212219
ingredients	0.45121830701828003
beheadings	0.49524351954460144
jeunet	0.5344780683517456
record	0.4754655957221985
learning	0.46492502093315125
clicks	0.4991827607154846
motivate	0.4920443594455719
michael	0.4491787850856781
fuzzy	0.5486447215080261
democracies	0.4088718891143799
embarrassment	0.4666833281517029
término	0.47157007455825806
austrian	0.48743581771850586
enters	0.5003231167793274
existence	0.5123335719108582
nauseating	0.450516939163208
corruption	0.4885949194431305
clungto	0.480815052986145
rejiggering	0.512667715549469
symmetrical	0.5080729722976685
reno	0.5096741318702698
collegefriends	0.5120016932487488
hits	0.4672362804412842
lucas	0.4865346848964691
gregory	0.4995262622833252
floyd	0.5041118860244751
zeroes	0.47356802225112915
deploys	0.48502060770988464
infectious	0.46042466163635254
bigscreen	0.49209457635879517
snickers	0.49578991532325745
affects	0.46959173679351807
scandalous	0.48228853940963745
happen	0.47819212079048157
inchoate	0.46183568239212036
beard	0.527775764465332
tvtomovie	0.5066941976547241
clicking	0.4971570372581482
gripping	0.4893611669540405
accepts	0.46922439336776733
beacon	0.4574068784713745
ordinances	0.4850981831550598
wanderers	0.5010761022567749
accompanies	0.5408692359924316
starpower	0.49492424726486206
paintbynumber	0.5221825242042542
mileage	0.49995335936546326
hjejle	0.484425812959671
outnumber	0.47110715508461
astronauts	0.4886006712913513
standupcomedy	0.5037035346031189
coma	0.4493735432624817
facing	0.5715073943138123
broomsticks	0.5065586566925049
selfinflicted	0.4778839647769928
globalizing	0.47984442114830017
lulled	0.44863036274909973
lawrences	0.44100889563560486
bungle	0.47965705394744873
prologue	0.5097969174385071
speedy	0.4801883399486542
damaged	0.48262524604797363
sputters	0.4660463333129883
unhibited	0.4863375723361969
sleeping	0.4791843295097351
breed	0.475425124168396
subjugate	0.4919116497039795
mcdonald	0.4963251054286957
illogic	0.4778381884098053
did	0.511164128780365
cattaneo	0.47353172302246094
dankworths	0.47430992126464844
força	0.48242923617362976
his	0.5136802196502686
faced	0.4833884835243225
combustion	0.4732980728149414
preview	0.47906699776649475
henna	0.5069488883018494
bikes	0.44099244475364685
havoc	0.5262261629104614
courting	0.49894243478775024
volume	0.5009750723838806
americanized	0.4504571259021759
shockingly	0.5088279843330383
thud	0.5173625946044922
grenier	0.519090473651886
thulani	0.48328113555908203
herself	0.49354058504104614
doting	0.5389575362205505
weathered	0.48346880078315735
piles	0.4292791485786438
dry	0.4542679786682129
hiatus	0.49237877130508423
opposites	0.4026193618774414
inside	0.4833512008190155
bridget	0.4676913917064667
flimsier	0.4805448651313782
darned	0.4891284108161926
sketched	0.4203096628189087
concession	0.4861335754394531
ingenuity	0.5017690062522888
cinta	0.48572465777397156
comienza	0.46615296602249146
disappoints	0.4754859209060669
enacted	0.4673932194709778
pero	0.4936869740486145
blighter	0.5353908538818359
creator	0.517600417137146
recycles	0.47928935289382935
punchier	0.4803525507450104
pageantry	0.48780956864356995
beings	0.5161081552505493
aboveaverage	0.49999886751174927
garage	0.5068008899688721
merrily	0.470503032207489
damn	0.4770909249782562
doublebarreled	0.4967423379421234
timely	0.5101076364517212
assistant	0.5149163007736206
brendan	0.4792589545249939
sophomoric	0.49581408500671387
imagining	0.5007805824279785
saccharine	0.5070960521697998
ferocity	0.5465189218521118
buildings	0.4673314690589905
intuitively	0.4783026874065399
plugged	0.5296075940132141
stew	0.49812397360801697
regular	0.494951069355011
carried	0.49205777049064636
bickering	0.4965991973876953
surrendering	0.45582088828086853
affectation	0.4561198353767395
compleja	0.4319855868816376
renowned	0.48764854669570923
snaillike	0.48441004753112793
lawyer	0.4896947741508484
surgeon	0.5463448762893677
generated	0.5057681798934937
tenyearold	0.48921799659729004
cheerfully	0.4816863536834717
needed	0.5445699691772461
weirdness	0.4914472699165344
usurp	0.5084125399589539
heartland	0.4496811628341675
plump	0.4878498315811157
rapids	0.511834442615509
provoked	0.39056727290153503
matrix	0.46239805221557617
spoken	0.5243216156959534
surpassed	0.4301395118236542
selfexamination	0.4835793972015381
portraiture	0.45731836557388306
regimented	0.47691798210144043
edged	0.4990795850753784
stereotyped	0.4766363203525543
onceover	0.5070135593414307
eloquent	0.5228692293167114
open	0.482882022857666
gob	0.48925480246543884
pasty	0.4878930151462555
ensnaring	0.479669451713562
boredom	0.5006809234619141
natured	0.49791157245635986
iosseliani	0.47748827934265137
typically	0.4959315359592438
hard	0.514545738697052
revoiced	0.4991757869720459
astounding	0.47589316964149475
softheaded	0.5074719786643982
ache	0.44009730219841003
aspect	0.498171865940094
havia	0.5180111527442932
sacrificing	0.4552254378795624
caucasian	0.40011584758758545
my	0.4476085901260376
wise	0.4901575446128845
device	0.4107179045677185
stones	0.5152848958969116
dull	0.49544069170951843
fat	0.47934550046920776
caretakers	0.47139668464660645
clink	0.4758065640926361
modesty	0.5063686966896057
toast	0.5273012518882751
watery	0.5025800466537476
resulted	0.5020699501037598
outoffield	0.5248066186904907
parlance	0.40690097212791443
afterthought	0.5245043039321899
congeals	0.49705907702445984
virtues	0.5387977361679077
suspected	0.5082924962043762
spot	0.4868033230304718
rake	0.4757708013057709
cruelty	0.48815733194351196
openended	0.5370858311653137
bernsteins	0.4962284564971924
kitchensink	0.42208999395370483
experiences	0.47213301062583923
teacher	0.4382515251636505
significant	0.4859519898891449
ritter	0.4947114884853363
gandalf	0.4947722256183624
joyful	0.5414137244224548
henry	0.5106996297836304
robbery	0.4839416742324829
violence	0.4396749436855316
patting	0.4499448537826538
ellie	0.47620952129364014
harmless	0.47239571809768677
nerves	0.48126325011253357
passage	0.5417874455451965
sturdiness	0.4968644380569458
opium	0.4914924204349518
ballplayer	0.45861759781837463
turned	0.5041568875312805
fish	0.46401891112327576
pete	0.471615731716156
tonedeaf	0.43063127994537354
spectacle	0.49718379974365234
selfknowledge	0.5109744668006897
prompting	0.4678221642971039
seeping	0.47570687532424927
weissman	0.4659122824668884
fed	0.39414411783218384
inflammatory	0.48584771156311035
ontiveros	0.5129098892211914
therell	0.47692441940307617
that	0.49771633744239807
indicates	0.48721617460250854
shankman	0.5012805461883545
teasing	0.49502530694007874
tinseltown	0.526752233505249
nationwide	0.46455633640289307
suddenly	0.4987403452396393
queasystomached	0.47981324791908264
effusion	0.47766804695129395
geneva	0.4680851101875305
pace	0.4191047251224518
rodriguez	0.4929825961589813
winces	0.4761356711387634
spontaneous	0.489341139793396
escape	0.47953224182128906
serpent	0.3924500048160553
handicap	0.5120701193809509
smirk	0.4962729811668396
cuarón	0.48854467272758484
coral	0.47992780804634094
cliffsnotes	0.5210129618644714
lesser	0.4665479063987732
implications	0.47718849778175354
blame	0.4706015884876251
oldschool	0.48238784074783325
farm	0.51609206199646
downer	0.47048455476760864
tadpole	0.5185387134552002
huskies	0.48598840832710266
originalidad	0.491915225982666
stockwell	0.5105019211769104
panorama	0.42325347661972046
filmed	0.520737886428833
yellow	0.4856335520744324
every	0.47182497382164
routines	0.49608153104782104
knockaround	0.5091196894645691
cake	0.4893207550048828
trumpets	0.49444618821144104
architectural	0.4744868576526642
sessions	0.4920981824398041
earnestly	0.5439061522483826
sorrowfully	0.4782377779483795
bolado	0.48650267720222473
sneaks	0.44514164328575134
intellectually	0.5283263921737671
dreyfus	0.5467202067375183
trouble	0.46037548780441284
reeked	0.4498175084590912
brand	0.5137711763381958
isolated	0.5462196469306946
yesterday	0.4842827320098877
racial	0.47779691219329834
jumbled	0.4935137629508972
associations	0.490884006023407
procedure	0.5158729553222656
heartwarmingly	0.5410667061805725
city	0.46594563126564026
campy	0.44265016913414
sarcasm	0.527499794960022
abject	0.4316045045852661
zombie	0.49498143792152405
truth	0.47875893115997314
carnahan	0.49055638909339905
eagerness	0.4946218729019165
totalitarian	0.5215094089508057
dogma	0.48614469170570374
bless	0.5088900923728943
paradisos	0.4984777271747589
technical	0.5440217852592468
probe	0.48769810795783997
authors	0.44579631090164185
dutifully	0.5787466764450073
spanish	0.4890536963939667
seasons	0.5391269326210022
appear	0.4749835431575775
picaresque	0.493696391582489
potemkin	0.5196680426597595
solondzian	0.502666175365448
keg	0.5239208936691284
violent	0.48700717091560364
artefact	0.4708789885044098
rockwell	0.4914836287498474
malice	0.461334228515625
spat	0.4594966471195221
teams	0.5425251126289368
stylings	0.3965440094470978
berkleys	0.4868994355201721
expressing	0.5031434297561646
avoiding	0.5112291574478149
russia	0.49522849917411804
woefully	0.44030019640922546
authenticity	0.4902048408985138
realidad	0.49180564284324646
penetrating	0.4887875020503998
lucratively	0.4273761808872223
skidrow	0.493132621049881
unusually	0.4709644913673401
bighearted	0.49405187368392944
poderosa	0.4852909445762634
rubbish	0.5338236689567566
hideously	0.47703057527542114
appearance	0.5070017576217651
pertinent	0.4623723328113556
polishing	0.4798612594604492
warmovie	0.49564480781555176
steal	0.5260228514671326
nasty	0.5251262187957764
consumption	0.5099753737449646
viscerally	0.5007578730583191
ready	0.5232573747634888
seasonal	0.49458253383636475
visitor	0.502250075340271
perverse	0.4784924387931824
pops	0.5378698706626892
sketches	0.47888481616973877
euphemism	0.48014479875564575
intelligence	0.4502333998680115
alleged	0.5018095374107361
awesome	0.48444220423698425
greene	0.409641832113266
mamets	0.48738646507263184
defeated	0.4804970622062683
garcia	0.49908098578453064
emotional	0.4968312382698059
studios	0.5143516659736633
balzac	0.49029889702796936
strangeness	0.5068796873092651
mistake	0.4930305778980255
lovers	0.4657571017742157
firstrate	0.47106048464775085
flavor	0.4933278560638428
dud	0.4914318919181824
imagery	0.4724486768245697
aimed	0.5133153200149536
struggling	0.3964329957962036
stationary	0.47625160217285156
evolves	0.4082282781600952
dogs	0.49308812618255615
phone	0.43942999839782715
dusty	0.5086904764175415
genuinely	0.5342732667922974
is	0.510794460773468
cube	0.4773370623588562
lush	0.49359095096588135
unit	0.4861319661140442
morningglory	0.4413537383079529
neatly	0.4654892086982727
neeson	0.5217697024345398
plutonium	0.4543881118297577
dysfunctionally	0.4821373522281647
largeframe	0.49632203578948975
cam	0.4855511486530304
stunning	0.5070244073867798
crimes	0.5264384150505066
mishmash	0.5545477271080017
rigors	0.5250744223594666
woundlicking	0.5263164043426514
modestly	0.5061275959014893
weaponry	0.5454661846160889
tells	0.4808538556098938
resources	0.48018190264701843
bodyswitching	0.4907899498939514
masquerade	0.4689522981643677
flyonthewall	0.4949815571308136
selfimportance	0.48642784357070923
riotcontrol	0.47197961807250977
implausibility	0.43811726570129395
affectingly	0.4887794554233551
vanished	0.4989396333694458
disorientated	0.4886849522590637
entitled	0.46143218874931335
li	0.4743459224700928
turmoil	0.48281851410865784
trombone	0.43177562952041626
alias	0.5148793458938599
rounded	0.4915420711040497
chevy	0.49579793214797974
disneys	0.41873684525489807
antes	0.49269095063209534
bombs	0.4795868992805481
heremakono	0.5007199048995972
neglected	0.46240100264549255
snappy	0.5407887697219849
fascinating	0.46483200788497925
hispanic	0.45597949624061584
spout	0.4617835581302643
serves	0.49695348739624023
accomplished	0.40885764360427856
exuberantly	0.5037844181060791
route	0.4800632894039154
talks	0.4964660704135895
diva	0.48646801710128784
12	0.48612526059150696
magically	0.49781110882759094
multiplex	0.504682183265686
compensated	0.537534236907959
happy	0.5496132969856262
abdul	0.48587766289711
selection	0.48033034801483154
underlined	0.49285778403282166
aiming	0.505153238773346
walledoff	0.5078462958335876
demographically	0.4979396462440491
mandates	0.45717403292655945
rome	0.5138679146766663
basted	0.4791066348552704
professionally	0.4813380241394043
dawdle	0.4859916865825653
he	0.4809826612472534
devitos	0.49040114879608154
earpleasing	0.4822198152542114
fires	0.5303626656532288
decorates	0.5545184016227722
accessibility	0.4975545406341553
support	0.4964337944984436
green	0.4908153712749481
separation	0.5008763670921326
forcing	0.5015257000923157
necessity	0.4603184461593628
reparto	0.4366271197795868
schrader	0.4561588168144226
middleaged	0.4637514054775238
unreality	0.5391113758087158
10year	0.45892271399497986
sleazy	0.47152626514434814
overweight	0.47041574120521545
once	0.4614972472190857
oneroom	0.48720496892929077
carry	0.508200466632843
hobnail	0.4719565212726593
casey	0.4584215581417084
methodical	0.5128717422485352
succumbing	0.4914586842060089
compellingly	0.49758026003837585
days	0.5120654702186584
diversions	0.5606125593185425
tools	0.47235798835754395
conversation	0.47942107915878296
rivals	0.4615422487258911
shed	0.4549225866794586
stuffing	0.5307515859603882
fingering	0.5103311538696289
galore	0.43221601843833923
humorous	0.48992136120796204
polite	0.4403134286403656
utmost	0.5353673100471497
gayton	0.4903573989868164
subsequently	0.5784494876861572
charismatic	0.4859611988067627
joan	0.44057610630989075
increase	0.48796001076698303
dishonorable	0.4824918508529663
minddestroying	0.5105488300323486
goya	0.4643107056617737
unlike	0.5475276708602905
buries	0.4847421646118164
zap	0.4854245185852051
represent	0.5095843076705933
nod	0.45267802476882935
caviezel	0.4795519709587097
vacant	0.4763472378253937
passer	0.5597895979881287
provided	0.46970507502555847
prepared	0.49393656849861145
yearn	0.5473495125770569
revolt	0.49300485849380493
letting	0.4900597929954529
actuación	0.45881393551826477
supremely	0.46417880058288574
rarity	0.4922046363353729
brimful	0.49150651693344116
katzenberg	0.47940945625305176
hemlock	0.5409284234046936
lighting	0.4931611716747284
calories	0.4966922402381897
takes	0.4714280366897583
feels	0.4679439961910248
hunter	0.48282524943351746
soulseye	0.495138555765152
joined	0.49541717767715454
china	0.4961681663990021
solving	0.4842032492160797
buffeted	0.5008224844932556
courtney	0.44166624546051025
manipulador	0.5271795988082886
campaign	0.5185726284980774
descriptions	0.37946850061416626
hooters	0.4654521644115448
boyz	0.47631508111953735
christmas	0.4707251489162445
cling	0.5213755369186401
firsttime	0.44400554895401
lived	0.459747850894928
psychopathy	0.4987492561340332
restrained	0.4413355588912964
love	0.5050537586212158
stupid	0.4632004201412201
cipherlike	0.49361324310302734
20yearold	0.48082607984542847
gulzar	0.4923630654811859
ably	0.4828190505504608
absurd	0.4568099081516266
drained	0.4518637955188751
shameless	0.4902893304824829
acabamos	0.4880531430244446
documenting	0.536545991897583
amiably	0.5037522912025452
andys	0.5010067224502563
humanly	0.477660596370697
passivity	0.48233190178871155
scorns	0.49386489391326904
quietness	0.5182631015777588
birots	0.5226892232894897
disappoint	0.48675382137298584
stretches	0.5022973418235779
waiting	0.4851103723049164
trip	0.48343953490257263
wailing	0.4972396194934845
stacy	0.4102736711502075
generic	0.49481987953186035
acquired	0.509140133857727
pulchritude	0.5806835293769836
anticipated	0.5022671222686768
crassathons	0.4917546808719635
cultures	0.4615330696105957
disturbingly	0.4786137640476227
true	0.4935845732688904
languidly	0.5598642826080322
cherished	0.4569281041622162
communal	0.497226744890213
convinces	0.4818483591079712
gorgeously	0.45964327454566956
surveyed	0.47603827714920044
queen	0.4331255555152893
brought	0.5117644667625427
chops	0.5080643892288208
accomplishment	0.516564667224884
exact	0.48175832629203796
shots	0.472910612821579
narratives	0.4902656376361847
differently	0.5112571120262146
predict	0.40800225734710693
explored	0.49434787034988403
parentchild	0.49333977699279785
hand	0.47758427262306213
surprises	0.474039226770401
push	0.5332955121994019
fizz	0.44656795263290405
shootemup	0.5410072803497314
streak	0.5016238689422607
offkilter	0.4986424744129181
energetic	0.46915191411972046
apted	0.5211920142173767
imitative	0.4412180781364441
travil	0.4948125183582306
catchy	0.5031211376190186
comparing	0.4613820016384125
spates	0.47367674112319946
instructive	0.49459871649742126
monroe	0.49008652567863464
romances	0.6123013496398926
uproariously	0.513666033744812
education	0.4978741407394409
schmidts	0.5022001266479492
commands	0.5475064516067505
integral	0.5690639019012451
exchanges	0.439523845911026
battle	0.5100916028022766
fatigues	0.5047889351844788
binks	0.49552690982818604
warnings	0.4750438332557678
dawn	0.481780469417572
selfpossessed	0.49962717294692993
misfire	0.4625032842159271
parrot	0.4018303155899048
eighth	0.509956955909729
midsection	0.49596965312957764
willing	0.45790591835975647
warn	0.5529374480247498
summary	0.4811917543411255
required	0.4905647933483124
alternate	0.45906129479408264
actress	0.4834159314632416
vary	0.5419792532920837
meanders	0.49585220217704773
honeys	0.48594343662261963
adobo	0.4681994915008545
yosuke	0.47652193903923035
dreamworks	0.4894198179244995
pic	0.5077969431877136
bela	0.5159003138542175
skies	0.4807066321372986
bolder	0.43896594643592834
hem	0.4781017303466797
libido	0.45996126532554626
carey	0.5170938372612
allwoman	0.48244941234588623
gratingly	0.4729911684989929
obtuse	0.5260042548179626
lifealtering	0.4898121953010559
helps	0.4882943630218506
prefer	0.5169311761856079
escapes	0.5049896836280823
madonna	0.4973435699939728
negate	0.4993757903575897
profile	0.5044414401054382
didactic	0.4635380506515503
readily	0.4807175397872925
undertones	0.4717889428138733
trite	0.47597676515579224
alcatraz	0.4913407862186432
print	0.4486047625541687
committed	0.4078088104724884
upper	0.4484556019306183
uncovers	0.4675176739692688
visualize	0.4170149266719818
traditionbound	0.5183417201042175
poopoo	0.5174480080604553
phoneyfeeling	0.459805428981781
idiosyncrasy	0.5019194483757019
spontaneity	0.44065576791763306
tons	0.4853479266166687
agitator	0.5547768473625183
report	0.5353817939758301
ease	0.48238465189933777
vent	0.4930783212184906
spots	0.508432924747467
skateboard	0.4875584542751312
taking	0.5017381906509399
notches	0.5996131896972656
specificity	0.49380868673324585
bugeyed	0.4982761740684509
misdemeanor	0.4821094274520874
título	0.5089660882949829
stilettostomps	0.4946203827857971
universally	0.4226588010787964
directive	0.5462482571601868
preprogrammed	0.5034485459327698
remarks	0.5098136067390442
faint	0.444850891828537
exemplary	0.4739123582839966
backstage	0.48730021715164185
spoil	0.4866941571235657
superior	0.49825477600097656
bag	0.5102813839912415
cravens	0.4852542281150818
inappropriate	0.534605085849762
achilles	0.4856506586074829
low	0.4913759231567383
bromides	0.4860953390598297
oprah	0.501791775226593
holiday	0.5116114020347595
empathy	0.47139212489128113
zboys	0.5356026291847229
sloppiness	0.4608573615550995
fulsome	0.5111313462257385
goround	0.5273654460906982
sever	0.45974165201187134
estrogenfree	0.516581654548645
know	0.4988233149051666
insinuating	0.49459630250930786
chins	0.5280342102050781
seeing	0.5365504026412964
glosses	0.4752632677555084
improvisation	0.4791547656059265
b12	0.47138869762420654
invented	0.4849551320075989
coriat	0.4917101263999939
cortez	0.4680211544036865
raw	0.47371238470077515
nevertheless	0.41869762539863586
leaky	0.4783393144607544
tierney	0.493831068277359
resolutions	0.4556857943534851
locals	0.4729924499988556
fabuleux	0.4815306067466736
israel	0.48424822092056274
submusic	0.4994516670703888
schiffer	0.4871809780597687
illuminate	0.47922664880752563
assimilated	0.48890745639801025
release	0.504635751247406
proposes	0.5093678832054138
tsos	0.4589237868785858
barf	0.4904105067253113
shallows	0.4824173152446747
beans	0.48004698753356934
eerie	0.4830676317214966
perhaps	0.5021030306816101
recharged	0.4972977042198181
projectile	0.49402880668640137
pyrocorrectly	0.45589491724967957
nubile	0.4652458131313324
rethink	0.49000084400177
guided	0.49960413575172424
reenactment	0.4778214991092682
goldie	0.5116742253303528
stepford	0.5121693015098572
assurance	0.41690585017204285
racing	0.4689578115940094
ravishing	0.4834216237068176
bizarre	0.5564821362495422
melancholic	0.530847430229187
confident	0.34779077768325806
sophisticated	0.48693814873695374
blended	0.4856293797492981
westerners	0.4514865279197693
portraying	0.509240984916687
consistently	0.4745650887489319
scattershot	0.5168761610984802
anothers	0.4725213944911957
each	0.4921846389770508
heros	0.5021330118179321
uniformly	0.4248546063899994
fessenden	0.4190947413444519
raft	0.446829617023468
warren	0.5098302960395813
choosing	0.43582695722579956
tuneless	0.541040301322937
inhabit	0.5103141069412231
enact	0.5003043413162231
tell	0.49475428462028503
varsity	0.5021780729293823
ohthosewackybrits	0.5002062320709229
lacking	0.49240320920944214
nonstop	0.4488278925418854
mercenary	0.4260092079639435
vulnerability	0.5015061497688293
acaba	0.4903428852558136
northwest	0.4778691828250885
distinctions	0.4928988516330719
coarse	0.426694393157959
distant	0.48897528648376465
misperception	0.4963650405406952
distancing	0.48321250081062317
aided	0.4987078607082367
representing	0.5416063070297241
tagline	0.4502214789390564
cruelly	0.4905904531478882
catalyst	0.4900544285774231
shores	0.48535746335983276
zelda	0.5043885111808777
ambition133	0.4346678555011749
cedric	0.47295013070106506
eternal	0.4892496168613434
discordant	0.500442385673523
substances	0.5631454586982727
early80s	0.462208092212677
plug	0.4904705882072449
discontent	0.5019012093544006
instante	0.4625477194786072
lucys	0.48514798283576965
schüttes	0.4945506453514099
avid	0.49339428544044495
upfront	0.4798155725002289
staggeringly	0.4460940659046173
theres	0.4876757562160492
koreas	0.5378117561340332
costume	0.49536237120628357
pleasurable	0.5406237244606018
kaufmans	0.5039023160934448
pamelas	0.44159549474716187
doldrums	0.495723158121109
pacino	0.44622722268104553
zealous	0.49267035722732544
noon	0.48478659987449646
crew	0.49696698784828186
sent	0.47812771797180176
doubts	0.42965465784072876
chuck	0.4936751127243042
senegalese	0.47195932269096375
starts	0.49826279282569885
conciliatory	0.45965954661369324
sinner	0.4418051838874817
monologue	0.48487451672554016
aids	0.49085745215415955
awake	0.4945136308670044
phenomena	0.5016852021217346
warp	0.4915011525154114
waters	0.5433595180511475
cliffhanger	0.5150111317634583
tasteful	0.4848088324069977
sommerss	0.4939885437488556
mistakes	0.4700811207294464
loyal	0.4876391887664795
sensual	0.49143344163894653
panache	0.5102581977844238
airconditioning	0.46546170115470886
jaglomized	0.5236458778381348
practice	0.5054462552070618
schnitzler	0.46454116702079773
hyperartificiality	0.5244241952896118
perkiness	0.49579378962516785
burdened	0.4693371057510376
veggie	0.5127074122428894
overinflated	0.5034010410308838
metaphysical	0.5232935547828674
unremarkable	0.5064616203308105
duke	0.36912763118743896
details	0.48604094982147217
intricate	0.48008638620376587
stanley	0.48409444093704224
windtalkers	0.5436410903930664
undercurrent	0.5237893462181091
coheres	0.49990469217300415
hairier	0.4776846766471863
último	0.48602938652038574
cia	0.4720236659049988
coolidge	0.5039477348327637
precollegiate	0.48695799708366394
prickly	0.4947573244571686
scene	0.4870442748069763
damon	0.47154441475868225
gritty	0.507209837436676
underarm	0.49352535605430603
act	0.5274760723114014
incinerates	0.468240350484848
everything	0.49322885274887085
momentary	0.47460293769836426
bronze	0.5090811252593994
thrust	0.48593947291374207
auteuils	0.49439093470573425
preschoolers	0.4899047017097473
started	0.5027958154678345
victim	0.5170538425445557
negative	0.49500882625579834
edmund	0.48502129316329956
childish	0.43899691104888916
sogginess	0.483646035194397
posible	0.4906371235847473
matchmaking	0.43770548701286316
predecible	0.48770010471343994
unfocused	0.478788822889328
complicate	0.4851910471916199
thrives	0.48814845085144043
roach	0.4931751489639282
repeated	0.5027182698249817
sucking	0.4467404782772064
betrayals	0.49386242032051086
pootie	0.5203697681427002
germanexpressionist	0.46422964334487915
somewhat	0.5156380534172058
used	0.48106178641319275
joel	0.488130122423172
essay	0.5318545699119568
objectivity	0.4863986670970917
bobbed	0.5194761753082275
ir	0.5425578355789185
filmes	0.5051426291465759
seamy	0.4835110604763031
knockout	0.49501457810401917
carwreck	0.517873227596283
primarily	0.4823724329471588
snoozy	0.439435750246048
matt	0.5058802366256714
culled	0.4892714321613312
interstitial	0.47354650497436523
wary	0.4585338830947876
paradiso	0.5022848844528198
deemed	0.5005313158035278
chord	0.4616059362888336
rope	0.412975013256073
celebrates	0.44742351770401
patrolman	0.4823714792728424
courtroom	0.490303099155426
lurid	0.4777362644672394
donna	0.49245065450668335
documakers	0.4401719570159912
candle	0.4209151864051819
attentions	0.49488136172294617
rude	0.47424209117889404
tempo	0.49585023522377014
hardwood	0.5088858008384705
bestsustained	0.48934170603752136
janine	0.4803420305252075
amiss	0.5039786100387573
trilogy	0.47759923338890076
outcome	0.4576548933982849
poorme	0.5036225914955139
plagued	0.5022295117378235
erasing	0.4820011258125305
periodpiece	0.4887734651565552
blender	0.4941803216934204
reported	0.4943971633911133
lyricism	0.5606071949005127
gutless	0.46789655089378357
fiery	0.4883841276168823
clownish	0.5056573152542114
register	0.5009704232215881
vivi	0.4844011664390564
pythons	0.4589894413948059
andersson	0.4851444959640503
tar	0.48536691069602966
nicholson	0.5050544738769531
soured	0.4702255427837372
jet	0.5001210570335388
passions	0.48334813117980957
exuberant	0.4968555271625519
locusts	0.5026987195014954
contorting	0.5107142329216003
generates	0.4911463260650635
tobacks	0.39735257625579834
pulled	0.43323814868927
ivans	0.5026646256446838
bobby	0.49960097670555115
deconstruction	0.49500614404678345
technosaturation	0.5380162000656128
posey	0.4957749545574188
everlasting	0.49157699942588806
duvalls	0.4937869906425476
tissue	0.49466413259506226
pr	0.49607348442077637
apenas	0.47574737668037415
unsung	0.4988184869289398
plateau	0.4725056290626526
gadgets	0.5207135677337646
competitive	0.48533543944358826
sofia	0.4997718930244446
thank	0.5023075938224792
king	0.4739840030670166
backbone	0.4861155152320862
tonguetied	0.4757227897644043
handle	0.470791220664978
charming	0.49028903245925903
circumstantial	0.4585391879081726
enthusiastically	0.49116837978363037
inspires	0.48717641830444336
closetosolid	0.5231879949569702
sleepdeprived	0.4983377456665039
potency	0.5052512288093567
temptingly	0.4844627380371094
believed	0.5120865702629089
connoisseurs	0.5110195875167847
sequels	0.5003963112831116
depend	0.5075805187225342
cursing	0.47829440236091614
latters	0.48343634605407715
outoutrage	0.48972102999687195
splash	0.5471370816230774
lector	0.4980981945991516
entwined	0.480460524559021
remains	0.4266917109489441
impresses	0.46127450466156006
bloodletting	0.5253052711486816
duo	0.497915655374527
ostensible	0.49361544847488403
hop	0.5207521915435791
empathize	0.5161956548690796
housekeepings	0.517578661441803
sinais	0.49620088934898376
intact	0.5440436005592346
knowing	0.5110592246055603
dj	0.513924777507782
saddled	0.4880995750427246
countercultural	0.48592013120651245
nail	0.49180883169174194
difference	0.47610124945640564
mariah	0.5046084523200989
pathos	0.4757902920246124
explanation	0.5082279443740845
recognizes	0.4468853771686554
contempt	0.44859546422958374
fault	0.5059056282043457
pummels	0.48673349618911743
funcionar	0.5739164352416992
oliver	0.5166513323783875
gay	0.49485766887664795
gosling	0.4846850037574768
surprisingly	0.4818013310432434
offered	0.48538336157798767
meatandpotatoes	0.5114592909812927
undercut	0.48648592829704285
success	0.5211003422737122
footage	0.4671843647956848
tightened	0.5012965202331543
freundlich	0.48699748516082764
scattered	0.4979799687862396
codes	0.49614205956459045
drunk	0.4835621416568756
fabulously	0.48529744148254395
deliver	0.5177516937255859
kieslowskis	0.5012028813362122
reckless	0.49720269441604614
ryder	0.45850124955177307
intactos	0.45073962211608887
progresses	0.4989767074584961
cada	0.516478419303894
solipsism	0.4824102222919464
byler	0.4969862997531891
sort	0.5141481757164001
boast	0.4951760172843933
quarter	0.49377697706222534
joans	0.48481836915016174
contrast	0.5059825778007507
annesophie	0.5143533945083618
friedmans	0.4842378795146942
gais	0.5018261671066284
reduction	0.5009064674377441
debrauwer	0.466966450214386
aboul	0.5276516675949097
spies	0.4853178858757019
vinegar	0.5032810568809509
makeupdeep	0.46697163581848145
attractions	0.4818726181983948
propensity	0.4833207428455353
necessary	0.4203442931175232
india	0.4160885810852051
fishy	0.48729538917541504
forbearing	0.4956257939338684
macdowells	0.5394935011863708
doggie	0.4321669936180115
momento	0.4946043789386749
dolorous	0.4910690188407898
brutality	0.5292558670043945
fog	0.5496724247932434
jaundiced	0.5130702257156372
carnivore	0.4742368459701538
danny	0.4543299674987793
evenflowing	0.4759357273578644
undisputed	0.45046907663345337
passages	0.47518253326416016
proof	0.46408331394195557
fullywritten	0.5078930258750916
punchlines	0.5146828293800354
scooby	0.5040026307106018
goyer	0.5031276941299438
ethical	0.5285912752151489
markers	0.4587845504283905
harm	0.5068339705467224
faked	0.4968959391117096
crisis	0.49821633100509644
torturing	0.48296916484832764
sharply	0.49163106083869934
coherence	0.4413577914237976
communism	0.49145564436912537
rapidly	0.4762585759162903
invade	0.4891628921031952
vincents	0.5219513177871704
forcefully	0.49630793929100037
barbarism	0.45102137327194214
soderbergh	0.5030220746994019
lights	0.5354954600334167
gluing	0.5392340421676636
burden	0.45878058671951294
monotone	0.4879622459411621
swaying	0.5046901106834412
mick	0.4609973132610321
dullness	0.5314330458641052
dictate	0.5331486463546753
ticktock	0.5131515860557556
pauline	0.5264546871185303
modernize	0.4764411747455597
shyamalan	0.4320164918899536
attempts	0.49269217252731323
facetious	0.49083083868026733
using	0.5182758569717407
shakespeare	0.5070317387580872
evocation	0.5351147651672363
signpost	0.4829341769218445
caesar	0.5369380712509155
landmark	0.5070776343345642
lulls	0.5198050141334534
jumble	0.4833010733127594
splendor	0.49131694436073303
cultural	0.4885826110839844
desarrollarse	0.47104763984680176
spectacular	0.5133070945739746
crash	0.49859827756881714
ended	0.5016906261444092
tier	0.48020076751708984
goodbad	0.47155874967575073
doug	0.412855327129364
flat	0.4836866855621338
hamlet	0.5274965167045593
lesson	0.4845462441444397
leader	0.5002461671829224
resonates	0.5050594806671143
visceral	0.5707990527153015
mouglalis	0.3895583152770996
virgin	0.4697112739086151
screening	0.5076680183410645
hupperts	0.49958494305610657
firebrand	0.5148904323577881
relieved	0.5344693064689636
disrobed	0.510144054889679
unorthodox	0.5264896154403687
undressed	0.4831676483154297
alltoofamiliar	0.4583345949649811
answering	0.4255753755569458
staleness	0.49241504073143005
enthralling	0.44282233715057373
munchs	0.497446745634079
background	0.5665289163589478
humanism	0.48415911197662354
corn	0.48122891783714294
among	0.4920080304145813
spotty	0.5121946930885315
ballistic	0.4687381982803345
felt	0.463818222284317
catandmouse	0.521514892578125
minimal	0.4210610091686249
tickles	0.48890799283981323
lifetime	0.4909352660179138
thinks	0.48634302616119385
gifted	0.5220751166343689
outrageousness	0.5071685910224915
inexplicably	0.49534833431243896
hurried	0.46969255805015564
1950	0.4771896004676819
realism	0.5082927346229553
blues	0.49113601446151733
lingers	0.4947487711906433
cheapened	0.534015417098999
attractive	0.4649387001991272
thekids	0.5019472241401672
virtue	0.5010090470314026
mode	0.5231453776359558
etc	0.46133503317832947
human	0.47104302048683167
killing	0.4660916328430176
magnetic	0.3901829719543457
natives	0.46852558851242065
adultery	0.4701969623565674
fingernails	0.4834114909172058
grown	0.5444896221160889
subjected	0.49130943417549133
anomaly	0.5367424488067627
idoosyncratic	0.43723589181900024
jolt	0.4983126223087311
asnasty	0.49149656295776367
clare	0.49805545806884766
prophetic	0.5006532669067383
discretion	0.5002460479736328
cry	0.4706089496612549
cadences	0.4762941002845764
particular	0.395057737827301
liberalism	0.4836135506629944
sparring	0.5041494965553284
misery	0.46516111493110657
unprovoked	0.4769609868526459
arbitrary	0.41263294219970703
games	0.4822380840778351
skulls	0.47994065284729004
hideous	0.49263277649879456
clever	0.519081711769104
barbecue	0.5306233167648315
depths	0.504217803478241
morrison	0.48826074600219727
recognizable	0.48659443855285645
undercurrents	0.5190092325210571
doctor	0.48553600907325745
outrunning	0.5463652610778809
asset	0.5020580887794495
harps	0.49903881549835205
duration	0.5036534667015076
indomitable	0.49642735719680786
bastard	0.5050655603408813
lectures	0.49148717522621155
program	0.506700336933136
troubadour	0.472177654504776
scripted	0.47837740182876587
pokémon	0.540299117565155
eyefilling	0.48874056339263916
knoxville	0.3862251043319702
manhood	0.474190890789032
entertainingly	0.5280108451843262
stepmom	0.5057438611984253
commonman	0.5076709389686584
gasping	0.5408117175102234
bondinspired	0.4673038721084595
illegal	0.4907650053501129
ostensibly	0.4748196601867676
buffoons	0.44593575596809387
overboard	0.4740947484970093
talkinghead	0.5089046955108643
inquisitiveness	0.38784223794937134
currency	0.5097387433052063
exploratory	0.48742568492889404
longsuffering	0.4386427402496338
complex	0.5084054470062256
desolation	0.38566040992736816
coping	0.47211089730262756
shainbergs	0.4906791150569916
behalf	0.541408896446228
outofkilter	0.5137534141540527
testud	0.489586740732193
captivated	0.5527057647705078
whiteempowered	0.5434133410453796
germanic	0.4696967899799347
stitch	0.4697817265987396
mountain	0.4964095950126648
staggering	0.4966185688972473
exhaustion	0.4179110825061798
poses	0.46853578090667725
japans	0.4566332697868347
rookie	0.47275084257125854
unsettling	0.49390706419944763
kicks	0.495105117559433
sanguine	0.5025143027305603
spoton	0.5104010701179504
films	0.48183345794677734
pump	0.4931100904941559
follow	0.49195700883865356
farcical	0.49505236744880676
obligada	0.4774019122123718
sven	0.4667399823665619
overlyfamiliar	0.48573675751686096
demented	0.5157197117805481
dampens	0.48825326561927795
dumass	0.5405404567718506
amari	0.470712810754776
plod	0.4794100821018219
estava	0.4930170178413391
liman	0.476060688495636
fooled	0.4284028708934784
crime	0.5135491490364075
chabrolian	0.5094413757324219
lin	0.40429937839508057
midway	0.49583256244659424
urgently	0.495659202337265
finely	0.4938678741455078
stinks	0.47656717896461487
pompeo	0.4365369975566864
intern	0.5068368911743164
sultry	0.4731541574001312
millers	0.46716007590293884
savagery	0.46700140833854675
seat	0.487315833568573
alter	0.4936337471008301
subliminally	0.48938146233558655
tartness	0.5044006705284119
whipcrack	0.4919643998146057
seasoned	0.48903706669807434
steamboat	0.4863651394844055
selfdramatizing	0.49852991104125977
slathered	0.49813205003738403
narrativa	0.47983822226524353
superlarge	0.47570788860321045
ragtag	0.45033979415893555
nauseatingly	0.5590406656265259
stroke	0.5217939615249634
sermonize	0.4974530339241028
gloriously	0.503186047077179
streaks	0.3920440673828125
favourite	0.4997307062149048
schlockfilled	0.4540901780128479
warmblooded	0.5302367210388184
ladder	0.4850621521472931
griffiths	0.49683740735054016
mug	0.5220316052436829
timeconsuming	0.48154217004776
gratitude	0.4947962760925293
lays	0.5010703206062317
soothing	0.5286991000175476
weils	0.48568299412727356
freeze	0.5145191550254822
critiquing	0.48170149326324463
recently	0.4945472776889801
pottymouthed	0.5071340203285217
thewliss	0.4858386218547821
show	0.4695422053337097
either	0.4900355041027069
snipes	0.5070968866348267
systematically	0.4948664903640747
ah	0.471995085477829
madefortv	0.47647738456726074
joão	0.5042129755020142
robbed	0.47069185972213745
wearing	0.49481984972953796
redgraves	0.4998226761817932
quashed	0.47263482213020325
dominatrixes	0.4882511794567108
pretentious	0.4751347303390503
memorial	0.4575057029724121
area	0.463124543428421
overtones	0.48061105608940125
outage	0.5079912543296814
doltish	0.542432963848114
accomplish	0.45719972252845764
surely	0.5228803753852844
formal	0.49987390637397766
wilcos	0.4973312318325043
longwinded	0.5098080635070801
radar	0.4852501451969147
eudora	0.47603216767311096
vampires	0.47875282168388367
middleearth	0.48812711238861084
clunky	0.48600444197654724
indignation	0.5273067951202393
absolutely	0.511893093585968
unstoppable	0.5103045701980591
dogwalker	0.5396376252174377
